"""
KeyError - когато даден ключ не е намерен в съществъващите ключове

AttributeError - препратката към атрибута не е успешна

ValueError - операция/функция получи правилен тип, но грешна стойност

NameError - не е намерено локално или глобално име. Свързаната стойност е съобщение за грешка, което включва името,
което не може да бъде намерено.

TypeError - дадена операция се прилага към обект от друг тип

IndexError - индекса на последователсност е извън обхвата

ModuleNotFoundError - коато модул не може да бъде импортиран

ZeroDivisionError - Когато вторият елемент на деление или операция е 0 по модул.

RuntimeError - откриване на грешка, която не попада в никоя от другите категории

FileNotFoundError - когато един файл е поискан, но не може да бъде намерен

OSError - ,,файлът не е намерен" - когато системата върне такъв отговор
"""